TexasInstruments/c2000ware-core-sdk/driverlib/f28p65x/driverlib/pin_map.h
#define GPIO_31_GPIO31                  0x00081E00U
#define GPIO_31_CANA_TX                 0x00081E01U
#define GPIO_31_EMIF1_WEN               0x00081E02U
#define GPIO_31_MCANA_TX                0x00081E03U
#define GPIO_31_OUTPUTXBAR8             0x00081E05U
#define GPIO_31_EQEP3_INDEX             0x00081E06U
#define GPIO_31_SD2_C4                  0x00081E07U
#define GPIO_31_EMIF1_RNW               0x00081E09U
#define GPIO_31_I2CA_SDA                0x00081E0AU
#define GPIO_31_EPWM16_B                0x00081E0DU
#define GPIO_31_SPID_POCI               0x00081E0FU

#define GPIO_32_GPIO32                  0x00460000U
#define GPIO_32_I2CA_SDA                0x00460001U
#define GPIO_32_EMIF1_CS0N              0x00460002U
#define GPIO_32_SPIA_PICO               0x00460003U
#define GPIO_32_EQEP4_A                 0x00460005U
#define GPIO_32_LINB_TX                 0x00460006U
#define GPIO_32_CLB_OUTPUTXBAR1         0x00460007U
#define GPIO_32_EMIF1_OEN               0x00460009U
#define GPIO_32_I2CA_SCL                0x0046000AU
#define GPIO_32_SPID_CLK                0x0046000FU

#define GPIO_33_GPIO33                  0x00460200U
#define GPIO_33_I2CA_SCL                0x00460201U
#define GPIO_33_EMIF1_RNW               0x00460202U
#define GPIO_33_SPIA_POCI               0x00460203U
#define GPIO_33_EQEP4_B                 0x00460205U
#define GPIO_33_CLB_OUTPUTXBAR2         0x00460207U
#define GPIO_33_EMIF1_BA0               0x00460209U
#define GPIO_33_ESC_LED_ERR             0x0046020BU
#define GPIO_33_SPID_PTE                0x0046020FU

#define GPIO_34_GPIO34                  0x00460400U
#define GPIO_34_OUTPUTXBAR1             0x00460401U
#define GPIO_34_EMIF1_CS2N              0x00460402U
#define GPIO_34_SPIA_CLK                0x00460403U
#define GPIO_34_EQEP4_STROBE            0x00460405U
#define GPIO_34_I2CB_SDA                0x00460406U
#define GPIO_34_CLB_OUTPUTXBAR3         0x00460407U
#define GPIO_34_EMIF1_BA1               0x00460409U
#define GPIO_34_ESC_LATCH0              0x0046040AU
#define GPIO_34_EPWM18_A                0x0046040BU
#define GPIO_34_SCIA_TX                 0x0046040DU
#define GPIO_34_ESC_SYNC0               0x0046040EU

#define GPIO_35_GPIO35                  0x00460600U
#define GPIO_35_SCIA_RX                 0x00460601U
#define GPIO_35_EMIF1_CS3N              0x00460602U
#define GPIO_35_SPIA_PTE                0x00460603U
#define GPIO_35_EQEP4_INDEX             0x00460605U
#define GPIO_35_I2CB_SCL                0x00460606U
#define GPIO_35_CLB_OUTPUTXBAR4         0x00460607U
#define GPIO_35_EMIF1_A0                0x00460609U
#define GPIO_35_ESC_LATCH1              0x0046060AU
#define GPIO_35_EPWM18_B                0x0046060BU
#define GPIO_35_ESC_SYNC1               0x0046060EU

#define GPIO_36_GPIO36                  0x00460800U
#define GPIO_36_SCIA_TX                 0x00460801U
#define GPIO_36_EMIF1_WAIT              0x00460802U
#define GPIO_36_CANA_RX                 0x00460806U
#define GPIO_36_CLB_OUTPUTXBAR5         0x00460807U
#define GPIO_36_EMIF1_A1                0x00460809U
#define GPIO_36_MCANA_RX                0x0046080AU
#define GPIO_36_SD1_D1                  0x0046080DU
#define GPIO_36_EMIF1_WEN               0x0046080EU

#define GPIO_37_GPIO37                  0x00460A00U
#define GPIO_37_OUTPUTXBAR2             0x00460A01U
#define GPIO_37_EMIF1_OEN               0x00460A02U
#define GPIO_37_EPWM18_A                0x00460A03U
#define GPIO_37_CANA_TX                 0x00460A06U
#define GPIO_37_CLB_OUTPUTXBAR6         0x00460A07U
#define GPIO_37_EMIF1_A2                0x00460A09U
#define GPIO_37_MCANA_TX                0x00460A0AU
#define GPIO_37_SD1_D2                  0x00460A0DU
#define GPIO_37_EMIF1_D24               0x00460A0EU

#define GPIO_38_GPIO38                  0x00460C00U
#define GPIO_38_EMIF1_A0                0x00460C02U
#define GPIO_38_EPWM18_B                0x00460C03U
#define GPIO_38_UARTA_TX                0x00460C05U
#define GPIO_38_SCIB_TX                 0x00460C06U
#define GPIO_38_CLB_OUTPUTXBAR7         0x00460C07U
#define GPIO_38_EMIF1_A3                0x00460C09U
#define GPIO_38_SD1_D3                  0x00460C0DU
#define GPIO_38_EMIF1_CS2N              0x00460C0EU

#define GPIO_39_GPIO39                  0x00460E00U
#define GPIO_39_EMIF1_A1                0x00460E02U
#define GPIO_39_UARTA_RX                0x00460E05U
#define GPIO_39_SCIB_RX                 0x00460E06U
#define GPIO_39_CLB_OUTPUTXBAR8         0x00460E07U
#define GPIO_39_EMIF1_A4                0x00460E09U
#define GPIO_39_ESC_MDIO_DATA           0x00460E0AU
#define GPIO_39_ESC_LED_RUN             0x00460E0BU
#define GPIO_39_SD1_D4                  0x00460E0DU
#define GPIO_39_FSIRXD_CLK              0x00460E0EU

#define GPIO_40_GPIO40                  0x00461000U
#define GPIO_40_EMIF1_A2                0x00461002U
#define GPIO_40_EPWM13_A                0x00461003U
#define GPIO_40_MCANB_RX                0x00461005U
#define GPIO_40_I2CB_SDA                0x00461006U
#define GPIO_40_SD4_C3                  0x00461007U
#define GPIO_40_ESC_GPO2                0x00461009U
#define GPIO_40_CLB_OUTPUTXBAR1         0x0046100AU
#define GPIO_40_SD2_C1                  0x0046100DU
#define GPIO_40_ESC_I2C_SDA             0x0046100EU

#define GPIO_41_GPIO41                  0x00461200U
#define GPIO_41_EMIF1_A3                0x00461202U
#define GPIO_41_EPWM13_B                0x00461203U
#define GPIO_41_MCANB_TX                0x00461205U
#define GPIO_41_I2CB_SCL                0x00461206U
#define GPIO_41_SD4_D3                  0x00461207U
#define GPIO_41_CLB_OUTPUTXBAR2         0x0046120AU
#define GPIO_41_SD2_D1                  0x0046120DU
#define GPIO_41_ESC_I2C_SCL             0x0046120EU
#define GPIO_41_FSIRXD_CLK              0x0046120FU

#define GPIO_42_GPIO42                  0x00461400U
#define GPIO_42_EPWM14_A                0x00461403U
#define GPIO_42_EQEP4_A                 0x00461405U
#define GPIO_42_I2CA_SDA                0x00461406U
#define GPIO_42_SD4_C4                  0x00461407U
#define GPIO_42_CLB_OUTPUTXBAR5         0x0046140AU
#define GPIO_42_UARTA_TX                0x0046140BU
#define GPIO_42_FSIRXD_D0               0x0046140EU
#define GPIO_42_SCIA_TX                 0x0046140FU

#define GPIO_43_GPIO43                  0x00461600U
#define GPIO_43_EPWM14_B                0x00461603U
#define GPIO_43_EQEP4_B                 0x00461605U
#define GPIO_43_I2CA_SCL                0x00461606U
#define GPIO_43_SD4_D4                  0x00461607U
#define GPIO_43_CLB_OUTPUTXBAR6         0x0046160AU
#define GPIO_43_UARTA_RX                0x0046160BU
#define GPIO_43_FSIRXD_D1               0x0046160EU
#define GPIO_43_SCIA_RX                 0x0046160FU

#define GPIO_44_GPIO44                  0x00461800U
#define GPIO_44_SPID_POCI               0x00461801U
#define GPIO_44_EMIF1_A4                0x00461802U
#define GPIO_44_MCANB_RX                0x00461803U
#define GPIO_44_SD3_C4                  0x00461806U
#define GPIO_44_UARTB_TX                0x00461807U
#define GPIO_44_CLB_OUTPUTXBAR6         0x0046180AU
#define GPIO_44_FSIRXD_CLK              0x0046180DU
#define GPIO_44_ESC_TX1_CLK             0x0046180EU

