TexasInstruments/c2000ware-core-sdk/driverlib/f28p65x/driverlib/pin_map.h
#define GPIO_45_GPIO45                  0x00461A00U
#define GPIO_45_SPID_PTE                0x00461A01U
#define GPIO_45_EMIF1_A5                0x00461A02U
#define GPIO_45_MCANB_TX                0x00461A03U
#define GPIO_45_SD3_D4                  0x00461A06U
#define GPIO_45_UARTB_RX                0x00461A07U
#define GPIO_45_CLB_OUTPUTXBAR7         0x00461A0AU
#define GPIO_45_ESC_TX1_ENA             0x00461A0EU

#define GPIO_46_GPIO46                  0x00461C00U
#define GPIO_46_EPWM4_A                 0x00461C01U
#define GPIO_46_EMIF1_A6                0x00461C02U
#define GPIO_46_EPWM14_A                0x00461C03U
#define GPIO_46_SCIA_RX                 0x00461C06U
#define GPIO_46_SD3_C4                  0x00461C07U
#define GPIO_46_ESC_MDIO_CLK            0x00461C0EU

#define GPIO_47_GPIO47                  0x00461E00U
#define GPIO_47_EPWM4_B                 0x00461E01U
#define GPIO_47_EMIF1_A7                0x00461E02U
#define GPIO_47_EPWM14_B                0x00461E03U
#define GPIO_47_SCIA_TX                 0x00461E06U
#define GPIO_47_SD4_C3                  0x00461E07U
#define GPIO_47_ESC_MDIO_DATA           0x00461E0EU

#define GPIO_48_GPIO48                  0x00480000U
#define GPIO_48_OUTPUTXBAR3             0x00480001U
#define GPIO_48_EMIF1_A8                0x00480002U
#define GPIO_48_SCIA_TX                 0x00480006U
#define GPIO_48_SD1_D1                  0x00480007U
#define GPIO_48_SD2_C2                  0x0048000DU
#define GPIO_48_ESC_PHY_CLK             0x0048000EU

#define GPIO_49_GPIO49                  0x00480200U
#define GPIO_49_OUTPUTXBAR4             0x00480201U
#define GPIO_49_EMIF1_A9                0x00480202U
#define GPIO_49_SCIA_RX                 0x00480206U
#define GPIO_49_SD1_C1                  0x00480207U
#define GPIO_49_EMIF1_A5                0x00480209U
#define GPIO_49_SD2_D1                  0x0048020DU
#define GPIO_49_FSITXA_D0               0x0048020EU

#define GPIO_50_GPIO50                  0x00480400U
#define GPIO_50_EQEP1_A                 0x00480401U
#define GPIO_50_EMIF1_A10               0x00480402U
#define GPIO_50_EPWM15_A                0x00480403U
#define GPIO_50_SPIC_PICO               0x00480406U
#define GPIO_50_SD1_D2                  0x00480407U
#define GPIO_50_EMIF1_A6                0x00480409U
#define GPIO_50_ESC_LATCH0              0x0048040BU
#define GPIO_50_SD2_D2                  0x0048040DU
#define GPIO_50_FSITXA_D1               0x0048040EU

#define GPIO_51_GPIO51                  0x00480600U
#define GPIO_51_EQEP1_B                 0x00480601U
#define GPIO_51_EMIF1_A11               0x00480602U
#define GPIO_51_EPWM15_B                0x00480603U
#define GPIO_51_SPIC_POCI               0x00480606U
#define GPIO_51_SD1_C2                  0x00480607U
#define GPIO_51_EMIF1_A7                0x00480609U
#define GPIO_51_ESC_LATCH1              0x0048060BU
#define GPIO_51_SD2_D3                  0x0048060DU
#define GPIO_51_FSITXA_CLK              0x0048060EU

#define GPIO_52_GPIO52                  0x00480800U
#define GPIO_52_EQEP1_STROBE            0x00480801U
#define GPIO_52_EMIF1_A12               0x00480802U
#define GPIO_52_EPWM16_A                0x00480803U
#define GPIO_52_SPIC_CLK                0x00480806U
#define GPIO_52_SD1_D3                  0x00480807U
#define GPIO_52_EMIF1_A8                0x00480809U
#define GPIO_52_ESC_MDIO_CLK            0x0048080BU
#define GPIO_52_SD2_D4                  0x0048080DU
#define GPIO_52_FSIRXA_D0               0x0048080EU

#define GPIO_53_GPIO53                  0x00480A00U
#define GPIO_53_EQEP1_INDEX             0x00480A01U
#define GPIO_53_EMIF1_D31               0x00480A02U
#define GPIO_53_SPIC_PTE                0x00480A06U
#define GPIO_53_SD1_C3                  0x00480A07U
#define GPIO_53_EMIF1_A9                0x00480A09U
#define GPIO_53_ESC_MDIO_DATA           0x00480A0BU
#define GPIO_53_SD1_C1                  0x00480A0DU
#define GPIO_53_FSIRXA_D1               0x00480A0EU

#define GPIO_54_GPIO54                  0x00480C00U
#define GPIO_54_SPIA_PICO               0x00480C01U
#define GPIO_54_EMIF1_D30               0x00480C02U
#define GPIO_54_EQEP2_A                 0x00480C05U
#define GPIO_54_SCIB_TX                 0x00480C06U
#define GPIO_54_SD1_D4                  0x00480C07U
#define GPIO_54_EMIF1_A10               0x00480C09U
#define GPIO_54_ESC_PHY_CLK             0x00480C0BU
#define GPIO_54_SD1_C2                  0x00480C0DU
#define GPIO_54_FSIRXA_CLK              0x00480C0EU

#define GPIO_55_GPIO55                  0x00480E00U
#define GPIO_55_SPIA_POCI               0x00480E01U
#define GPIO_55_EMIF1_D29               0x00480E02U
#define GPIO_55_EPWM16_B                0x00480E03U
#define GPIO_55_EQEP2_B                 0x00480E05U
#define GPIO_55_SCIB_RX                 0x00480E06U
#define GPIO_55_SD1_C4                  0x00480E07U
#define GPIO_55_EMIF1_D0                0x00480E09U
#define GPIO_55_ESC_PHY0_LINKSTATUS     0x00480E0BU
#define GPIO_55_SD1_C3                  0x00480E0DU
#define GPIO_55_FSITXB_D0               0x00480E0EU

#define GPIO_56_GPIO56                  0x00481000U
#define GPIO_56_SPIA_CLK                0x00481001U
#define GPIO_56_EMIF1_D28               0x00481002U
#define GPIO_56_EPWM17_A                0x00481003U
#define GPIO_56_EQEP2_STROBE            0x00481005U
#define GPIO_56_SD2_D1                  0x00481007U
#define GPIO_56_EMIF1_D1                0x00481009U
#define GPIO_56_I2CA_SDA                0x0048100AU
#define GPIO_56_ESC_TX0_ENA             0x0048100BU
#define GPIO_56_SD1_C4                  0x0048100DU
#define GPIO_56_FSITXB_CLK              0x0048100EU

#define GPIO_57_GPIO57                  0x00481200U
#define GPIO_57_SPIA_PTE                0x00481201U
#define GPIO_57_EMIF1_D27               0x00481202U
#define GPIO_57_EPWM17_B                0x00481203U
#define GPIO_57_EQEP2_INDEX             0x00481205U
#define GPIO_57_SD2_C1                  0x00481207U
#define GPIO_57_EMIF1_D2                0x00481209U
#define GPIO_57_I2CA_SCL                0x0048120AU
#define GPIO_57_ESC_TX0_CLK             0x0048120BU
#define GPIO_57_SD3_D3                  0x0048120DU
#define GPIO_57_FSITXB_D1               0x0048120EU

#define GPIO_58_GPIO58                  0x00481400U
#define GPIO_58_SPIA_PICO               0x00481401U
#define GPIO_58_EMIF1_D26               0x00481402U
#define GPIO_58_EPWM8_A                 0x00481403U
#define GPIO_58_OUTPUTXBAR1             0x00481405U
#define GPIO_58_SPIB_CLK                0x00481406U
#define GPIO_58_SD2_D2                  0x00481407U
#define GPIO_58_EMIF1_D3                0x00481409U
#define GPIO_58_ESC_LED_LINK0_ACTIVE    0x0048140AU
#define GPIO_58_CANA_RX                 0x0048140BU
#define GPIO_58_SD2_C2                  0x0048140DU
#define GPIO_58_FSIRXB_D0               0x0048140EU

#define GPIO_59_GPIO59                  0x00481600U
#define GPIO_59_EPWM5_A                 0x00481601U
#define GPIO_59_EMIF1_D25               0x00481602U
#define GPIO_59_EPWM8_B                 0x00481603U
#define GPIO_59_OUTPUTXBAR2             0x00481605U
#define GPIO_59_SPIB_PTE                0x00481606U
#define GPIO_59_SD2_C2                  0x00481607U
#define GPIO_59_EMIF1_D4                0x00481609U
#define GPIO_59_ESC_LED_LINK1_ACTIVE    0x0048160AU
#define GPIO_59_CANA_TX                 0x0048160BU
#define GPIO_59_SD2_C3                  0x0048160DU
#define GPIO_59_FSIRXB_D1               0x0048160EU
#define GPIO_59_SPIA_POCI               0x0048160FU

#define GPIO_60_GPIO60                  0x00481800U
#define GPIO_60_EPWM3_B                 0x00481801U
#define GPIO_60_EMIF1_D24               0x00481802U
#define GPIO_60_ESC_LATCH0              0x00481803U
#define GPIO_60_OUTPUTXBAR3             0x00481805U
#define GPIO_60_SPIB_PICO               0x00481806U
#define GPIO_60_SD2_D3                  0x00481807U
#define GPIO_60_EMIF1_D5                0x00481809U
#define GPIO_60_ESC_LED_ERR             0x0048180AU
#define GPIO_60_SD2_C4                  0x0048180DU
#define GPIO_60_FSIRXB_CLK              0x0048180EU
#define GPIO_60_SPIA_CLK                0x0048180FU

