TexasInstruments/c2000ware-core-sdk/driverlib/f28p65x/driverlib/pin_map.h
#define GPIO_105_GPIO105                0x00C61200U
#define GPIO_105_I2CA_SCL               0x00C61201U
#define GPIO_105_EPWM18_B               0x00C61202U
#define GPIO_105_EQEP3_B                0x00C61205U
#define GPIO_105_SD3_C1                 0x00C61206U
#define GPIO_105_ESC_GPI5               0x00C6120AU
#define GPIO_105_FSIRXA_CLK             0x00C6120DU
#define GPIO_105_ESC_SYNC1              0x00C6120EU

#define GPIO_106_GPIO106                0x00C61400U
#define GPIO_106_EPWM16_A               0x00C61401U
#define GPIO_106_EMIF1_A10              0x00C61402U
#define GPIO_106_EQEP3_STROBE           0x00C61405U
#define GPIO_106_SD3_D2                 0x00C61406U
#define GPIO_106_ESC_GPI6               0x00C6140AU
#define GPIO_106_FSITXB_D0              0x00C6140DU

#define GPIO_107_GPIO107                0x00C61600U
#define GPIO_107_EPWM16_B               0x00C61601U
#define GPIO_107_EQEP3_INDEX            0x00C61605U
#define GPIO_107_SD3_C2                 0x00C61606U
#define GPIO_107_ESC_GPI7               0x00C6160AU
#define GPIO_107_FSITXB_D1              0x00C6160DU

#define GPIO_108_GPIO108                0x00C61800U
#define GPIO_108_EPWM17_A               0x00C61801U
#define GPIO_108_EMIF1_A12              0x00C61802U
#define GPIO_108_EQEP5_A                0x00C61805U
#define GPIO_108_SD3_D3                 0x00C61806U
#define GPIO_108_ESC_GPI8               0x00C6180AU
#define GPIO_108_FSITXB_CLK             0x00C6180DU

#define GPIO_109_GPIO109                0x00C61A00U
#define GPIO_109_EPWM17_B               0x00C61A01U
#define GPIO_109_EMIF1_A11              0x00C61A02U
#define GPIO_109_EQEP5_B                0x00C61A05U
#define GPIO_109_SD3_C3                 0x00C61A06U
#define GPIO_109_ESC_GPI9               0x00C61A0AU

#define GPIO_110_GPIO110                0x00C61C00U
#define GPIO_110_EMIF1_D31              0x00C61C01U
#define GPIO_110_EQEP5_STROBE           0x00C61C05U
#define GPIO_110_SD3_D4                 0x00C61C06U
#define GPIO_110_ESC_GPI10              0x00C61C0AU
#define GPIO_110_FSIRXB_D0              0x00C61C0DU

#define GPIO_111_GPIO111                0x00C61E00U
#define GPIO_111_EMIF1_D30              0x00C61E01U
#define GPIO_111_EQEP5_INDEX            0x00C61E05U
#define GPIO_111_SD3_C4                 0x00C61E06U
#define GPIO_111_ESC_GPI11              0x00C61E0AU
#define GPIO_111_FSIRXB_D1              0x00C61E0DU

#define GPIO_112_GPIO112                0x00C80000U
#define GPIO_112_EMIF1_D29              0x00C80001U
#define GPIO_112_SD1_D3                 0x00C80007U
#define GPIO_112_ESC_GPI12              0x00C8000AU
#define GPIO_112_FSIRXB_CLK             0x00C8000DU

#define GPIO_113_GPIO113                0x00C80200U
#define GPIO_113_EMIF1_D28              0x00C80201U
#define GPIO_113_SD1_C3                 0x00C80207U
#define GPIO_113_ESC_GPI13              0x00C8020AU

#define GPIO_114_GPIO114                0x00C80400U
#define GPIO_114_EMIF1_D27              0x00C80401U
#define GPIO_114_SD1_D4                 0x00C80407U
#define GPIO_114_ESC_GPI14              0x00C8040AU

#define GPIO_115_GPIO115                0x00C80600U
#define GPIO_115_EMIF1_D26              0x00C80601U
#define GPIO_115_OUTPUTXBAR5            0x00C80605U
#define GPIO_115_SD1_C4                 0x00C80607U
#define GPIO_115_ESC_GPI15              0x00C8060AU
#define GPIO_115_FSIRXC_D0              0x00C8060DU

#define GPIO_116_GPIO116                0x00C80800U
#define GPIO_116_OUTPUTXBAR6            0x00C80805U
#define GPIO_116_ESC_GPI16              0x00C8080AU
#define GPIO_116_FSIRXC_D1              0x00C8080DU

#define GPIO_117_GPIO117                0x00C80A00U
#define GPIO_117_ESC_GPI17              0x00C80A0AU
#define GPIO_117_FSIRXC_CLK             0x00C80A0DU

#define GPIO_118_GPIO118                0x00C80C00U
#define GPIO_118_ESC_GPI18              0x00C80C0AU
#define GPIO_118_FSIRXD_D0              0x00C80C0DU

#define GPIO_119_GPIO119                0x00C80E00U
#define GPIO_119_EMIF1_D25              0x00C80E01U
#define GPIO_119_MCANB_TX               0x00C80E05U
#define GPIO_119_ESC_GPI19              0x00C80E0AU
#define GPIO_119_FSIRXD_D1              0x00C80E0DU

#define GPIO_120_GPIO120                0x00C81000U
#define GPIO_120_EMIF1_D24              0x00C81001U
#define GPIO_120_MCANB_RX               0x00C81005U
#define GPIO_120_ESC_GPI20              0x00C8100AU
#define GPIO_120_FSIRXD_CLK             0x00C8100DU

#define GPIO_121_GPIO121                0x00C81200U
#define GPIO_121_ESC_GPI21              0x00C8120AU

#define GPIO_122_GPIO122                0x00C81400U
#define GPIO_122_EMIF1_D23              0x00C81401U
#define GPIO_122_SPIC_PICO              0x00C81406U
#define GPIO_122_SD1_D1                 0x00C81407U
#define GPIO_122_ESC_GPI22              0x00C8140AU

#define GPIO_123_GPIO123                0x00C81600U
#define GPIO_123_EMIF1_D22              0x00C81601U
#define GPIO_123_SPIC_POCI              0x00C81606U
#define GPIO_123_SD1_C1                 0x00C81607U
#define GPIO_123_ESC_GPI23              0x00C8160AU

#define GPIO_124_GPIO124                0x00C81800U
#define GPIO_124_EMIF1_D21              0x00C81801U
#define GPIO_124_SPIC_CLK               0x00C81806U
#define GPIO_124_SD1_D2                 0x00C81807U
#define GPIO_124_ESC_GPI24              0x00C8180AU

#define GPIO_125_GPIO125                0x00C81A00U
#define GPIO_125_EMIF1_D20              0x00C81A01U
#define GPIO_125_SPIC_PTE               0x00C81A06U
#define GPIO_125_SD1_C2                 0x00C81A07U
#define GPIO_125_ESC_GPI25              0x00C81A0AU
#define GPIO_125_ESC_LATCH0             0x00C81A0EU

#define GPIO_126_GPIO126                0x00C81C00U
#define GPIO_126_EMIF1_D19              0x00C81C01U
#define GPIO_126_SPID_PICO              0x00C81C06U
#define GPIO_126_SD1_D3                 0x00C81C07U
#define GPIO_126_ESC_GPI26              0x00C81C0AU
#define GPIO_126_ESC_LATCH1             0x00C81C0EU

#define GPIO_127_GPIO127                0x00C81E00U
#define GPIO_127_EMIF1_D18              0x00C81E01U
#define GPIO_127_SPID_POCI              0x00C81E06U
#define GPIO_127_SD1_C3                 0x00C81E07U
#define GPIO_127_ESC_GPI27              0x00C81E0AU
#define GPIO_127_ESC_SYNC0              0x00C81E0EU

#define GPIO_128_GPIO128                0x01060000U
#define GPIO_128_EMIF1_D17              0x01060001U
#define GPIO_128_SPID_CLK               0x01060006U
#define GPIO_128_SD1_D4                 0x01060007U
#define GPIO_128_ESC_GPI28              0x0106000AU
#define GPIO_128_ESC_SYNC1              0x0106000EU

#define GPIO_129_GPIO129                0x01060200U
#define GPIO_129_EMIF1_D16              0x01060201U
#define GPIO_129_SPID_PTE               0x01060206U
#define GPIO_129_SD1_C4                 0x01060207U
#define GPIO_129_ESC_GPI29              0x0106020AU
#define GPIO_129_ESC_TX1_ENA            0x0106020EU

#define GPIO_130_GPIO130                0x01060400U
#define GPIO_130_EPWM13_A               0x01060401U
#define GPIO_130_SD2_D1                 0x01060407U
#define GPIO_130_ESC_GPI30              0x0106040AU
#define GPIO_130_ESC_TX1_CLK            0x0106040EU

