TexasInstruments/c2000ware-core-sdk/driverlib/f28p65x/driverlib/pin_map.h
#define GPIO_204_GPIO204                0x01861800U
#define GPIO_204_OUTPUTXBAR4            0x01861801U
#define GPIO_204_EQEP2_STROBE           0x01861802U
#define GPIO_204_SPIA_CLK               0x01861803U
#define GPIO_204_SPIB_PTE               0x01861806U
#define GPIO_204_SD2_C2                 0x01861807U
#define GPIO_204_PMBUSA_CTL             0x01861809U
#define GPIO_204_EMIF1_DQM3             0x0186180AU
#define GPIO_204_ESC_MDIO_DATA          0x0186180BU
#define GPIO_204_EPWM14_B               0x0186180DU
#define GPIO_204_FSITXA_CLK             0x0186180EU
#define GPIO_204_SD1_D3                 0x0186180FU

#define GPIO_205_GPIO205                0x01861A00U
#define GPIO_205_EQEP1_INDEX            0x01861A01U
#define GPIO_205_EPWM10_A               0x01861A02U
#define GPIO_205_SPIA_PTE               0x01861A03U
#define GPIO_205_OUTPUTXBAR1            0x01861A0BU
#define GPIO_205_SD1_C3                 0x01861A0FU

#define GPIO_206_GPIO206                0x01861C00U
#define GPIO_206_EMIF1_A11              0x01861C01U
#define GPIO_206_EPWM10_B               0x01861C02U
#define GPIO_206_EMIF1_WEN              0x01861C03U
#define GPIO_206_OUTPUTXBAR2            0x01861C0BU
#define GPIO_206_ESC_PHY_CLK            0x01861C0EU
#define GPIO_206_ESC_LED_STATE_RUN      0x01861C0FU

#define GPIO_207_GPIO207                0x01861E00U
#define GPIO_207_EQEP2_A                0x01861E01U
#define GPIO_207_EPWM11_A               0x01861E02U
#define GPIO_207_EXTSYNCOUT             0x01861E03U
#define GPIO_207_CANA_TX                0x01861E05U
#define GPIO_207_SD4_D1                 0x01861E06U
#define GPIO_207_SCIA_RX                0x01861E07U
#define GPIO_207_LINA_RX                0x01861E09U
#define GPIO_207_I2CB_SCL               0x01861E0AU
#define GPIO_207_OUTPUTXBAR3            0x01861E0BU
#define GPIO_207_ESC_RX1_CLK            0x01861E0EU
#define GPIO_207_PMBUSA_ALERT           0x01861E0FU

#define GPIO_208_GPIO208                0x01880000U
#define GPIO_208_EQEP2_B                0x01880001U
#define GPIO_208_EPWM11_B               0x01880002U
#define GPIO_208_EMIF1_D13              0x01880003U
#define GPIO_208_SPIB_PICO              0x01880005U
#define GPIO_208_SD4_C1                 0x01880006U
#define GPIO_208_SCIA_TX                0x01880007U
#define GPIO_208_OUTPUTXBAR4            0x0188000BU
#define GPIO_208_ESC_RX1_DV             0x0188000EU
#define GPIO_208_PMBUSA_CTL             0x0188000FU

#define GPIO_209_GPIO209                0x01880200U
#define GPIO_209_EQEP2_STROBE           0x01880201U
#define GPIO_209_EPWM12_A               0x01880202U
#define GPIO_209_EMIF1_D14              0x01880203U
#define GPIO_209_SPIB_POCI              0x01880205U
#define GPIO_209_SD4_D2                 0x01880206U
#define GPIO_209_EPWM12_B               0x01880207U
#define GPIO_209_LINB_RX                0x0188020AU
#define GPIO_209_OUTPUTXBAR5            0x0188020BU
#define GPIO_209_ESC_RX1_ERR            0x0188020EU
#define GPIO_209_PMBUSA_SDA             0x0188020FU

#define GPIO_210_GPIO210                0x01880400U
#define GPIO_210_EQEP2_INDEX            0x01880401U
#define GPIO_210_EPWM12_B               0x01880402U
#define GPIO_210_EMIF1_D15              0x01880403U
#define GPIO_210_SD4_C2                 0x01880406U
#define GPIO_210_LINB_TX                0x0188040AU
#define GPIO_210_OUTPUTXBAR6            0x0188040BU
#define GPIO_210_ESC_RX0_DATA2          0x0188040EU
#define GPIO_210_PMBUSA_SCL             0x0188040FU

#define GPIO_211_GPIO211                0x01880600U
#define GPIO_211_EQEP6_A                0x01880601U
#define GPIO_211_EPWM14_A               0x01880602U
#define GPIO_211_SD4_D3                 0x01880606U
#define GPIO_211_OUTPUTXBAR7            0x0188060BU
#define GPIO_211_ESC_LED_LINK0_ACTIVE   0x0188060EU

#define GPIO_212_GPIO212                0x01880800U
#define GPIO_212_EQEP6_B                0x01880801U
#define GPIO_212_EPWM14_B               0x01880802U
#define GPIO_212_SD4_C3                 0x01880806U
#define GPIO_212_ESC_LED_LINK1_ACTIVE   0x0188080EU

#define GPIO_213_GPIO213                0x01880A00U
#define GPIO_213_EQEP6_STROBE           0x01880A01U
#define GPIO_213_EPWM8_A                0x01880A02U
#define GPIO_213_SD4_D4                 0x01880A06U
#define GPIO_213_LINB_TX                0x01880A0AU
#define GPIO_213_ESC_LED_ERR            0x01880A0EU

#define GPIO_214_GPIO214                0x01880C00U
#define GPIO_214_CANA_RX                0x01880C01U
#define GPIO_214_EMIF1_CLK              0x01880C02U
#define GPIO_214_MCANA_RX               0x01880C03U
#define GPIO_214_OUTPUTXBAR7            0x01880C05U
#define GPIO_214_EQEP3_STROBE           0x01880C06U
#define GPIO_214_SD2_D4                 0x01880C07U
#define GPIO_214_EMIF1_CS4N             0x01880C09U
#define GPIO_214_ESC_LATCH1             0x01880C0AU
#define GPIO_214_ESC_I2C_SCL            0x01880C0BU
#define GPIO_214_EPWM16_A               0x01880C0DU
#define GPIO_214_ESC_SYNC1              0x01880C0EU
#define GPIO_214_SPID_PICO              0x01880C0FU

#define GPIO_215_GPIO215                0x01880E00U
#define GPIO_215_SCIA_RX                0x01880E01U
#define GPIO_215_EMIF1_CS4N             0x01880E02U
#define GPIO_215_CANA_RX                0x01880E03U
#define GPIO_215_OUTPUTXBAR5            0x01880E05U
#define GPIO_215_EQEP3_A                0x01880E06U
#define GPIO_215_SD2_D3                 0x01880E07U
#define GPIO_215_EMIF1_CS2N             0x01880E09U
#define GPIO_215_I2CB_SDA               0x01880E0AU
#define GPIO_215_SPIC_POCI              0x01880E0BU
#define GPIO_215_EPWM15_A               0x01880E0DU
#define GPIO_215_LINA_TX                0x01880E0EU
#define GPIO_215_EMIF1_D12              0x01880E0FU

#define GPIO_216_GPIO216                0x01881000U
#define GPIO_216_SCIA_TX                0x01881001U
#define GPIO_216_EMIF1_SDCKE            0x01881002U
#define GPIO_216_SPID_CLK               0x01881003U
#define GPIO_216_OUTPUTXBAR6            0x01881005U
#define GPIO_216_EQEP3_B                0x01881006U
#define GPIO_216_SD2_C3                 0x01881007U
#define GPIO_216_EMIF1_CS3N             0x01881009U
#define GPIO_216_ESC_LATCH0             0x0188100AU
#define GPIO_216_ESC_I2C_SDA            0x0188100BU
#define GPIO_216_EPWM15_B               0x0188100DU
#define GPIO_216_ESC_SYNC0              0x0188100EU
#define GPIO_216_EMIF1_D13              0x0188100FU

#define GPIO_217_GPIO217                0x01881200U
#define GPIO_217_CANA_TX                0x01881201U
#define GPIO_217_EMIF1_WEN              0x01881202U
#define GPIO_217_MCANA_TX               0x01881203U
#define GPIO_217_OUTPUTXBAR8            0x01881205U
#define GPIO_217_EQEP3_INDEX            0x01881206U
#define GPIO_217_SD2_C4                 0x01881207U
#define GPIO_217_EMIF1_RNW              0x01881209U
#define GPIO_217_I2CA_SDA               0x0188120AU
#define GPIO_217_SPID_PTE               0x0188120BU
#define GPIO_217_EPWM16_B               0x0188120DU
#define GPIO_217_LINB_TX                0x0188120EU
#define GPIO_217_SPID_POCI              0x0188120FU

#define GPIO_218_GPIO218                0x01881400U
#define GPIO_218_I2CA_SDA               0x01881401U
#define GPIO_218_EMIF1_CS0N             0x01881402U
#define GPIO_218_SPIA_PICO              0x01881403U
#define GPIO_218_EQEP4_A                0x01881405U
#define GPIO_218_LINB_TX                0x01881406U
#define GPIO_218_CLB_OUTPUTXBAR1        0x01881407U
#define GPIO_218_EMIF1_OEN              0x01881409U
#define GPIO_218_I2CA_SCL               0x0188140AU
#define GPIO_218_SPID_CLK               0x0188140FU

#define GPIO_219_GPIO219                0x01881600U
#define GPIO_219_EQEP6_INDEX            0x01881601U
#define GPIO_219_EPWM8_B                0x01881602U
#define GPIO_219_SD4_C4                 0x01881606U
#define GPIO_219_ESC_LED_RUN            0x0188160EU

