TexasInstruments/c2000ware-core-sdk/driverlib/f28p65x/driverlib/pin_map.h
#define GPIO_220_GPIO220                0x01881800U
#define GPIO_220_EPWM6_A                0x01881802U
#define GPIO_220_SPID_POCI              0x01881803U
#define GPIO_220_OUTPUTXBAR2            0x01881805U
#define GPIO_220_SCIB_TX                0x01881806U
#define GPIO_220_MCANA_TX               0x01881807U
#define GPIO_220_PMBUSA_ALERT           0x0188180FU

#define GPIO_221_GPIO221                0x01881A00U
#define GPIO_221_EPWM6_B                0x01881A02U
#define GPIO_221_SPID_PTE               0x01881A03U
#define GPIO_221_OUTPUTXBAR3            0x01881A05U
#define GPIO_221_SCIB_RX                0x01881A06U
#define GPIO_221_MCANA_RX               0x01881A07U
#define GPIO_221_PMBUSA_CTL             0x01881A0FU

#define GPIO_222_GPIO222                0x01881C00U
#define GPIO_222_TDI                    0x01881C01U
#define GPIO_222_EPWM7_A                0x01881C02U
#define GPIO_222_SPIA_PICO              0x01881C03U
#define GPIO_222_OUTPUTXBAR4            0x01881C05U
#define GPIO_222_SCIA_RX                0x01881C06U
#define GPIO_222_UARTB_TX               0x01881C07U
#define GPIO_222_I2CA_SDA               0x01881C09U
#define GPIO_222_SPIC_CLK               0x01881C0AU
#define GPIO_222_ESC_PDI_UC_IRQ         0x01881C0EU
#define GPIO_222_PMBUSA_SDA             0x01881C0FU

#define GPIO_223_GPIO223                0x01881E00U
#define GPIO_223_TDO                    0x01881E01U
#define GPIO_223_EPWM7_B                0x01881E02U
#define GPIO_223_EMIF1_A11              0x01881E03U
#define GPIO_223_OUTPUTXBAR5            0x01881E05U
#define GPIO_223_SCIA_TX                0x01881E06U
#define GPIO_223_UARTB_RX               0x01881E07U
#define GPIO_223_I2CA_SCL               0x01881E09U
#define GPIO_223_SPIC_PTE               0x01881E0AU
#define GPIO_223_PMBUSA_SCL             0x01881E0FU

#define GPIO_224_GPIO224                0x01C60000U
#define GPIO_224_ERRORSTS               0x01C60001U
#define GPIO_224_EMIF1_SDCKE            0x01C60002U
#define GPIO_224_XCLKOUT                0x01C60003U
#define GPIO_224_OUTPUTXBAR1            0x01C60005U
#define GPIO_224_SD2_C1                 0x01C6000DU
#define GPIO_224_ESC_PDI_UC_IRQ         0x01C6000EU

#define GPIO_225_GPIO225                0x01C60200U

#define GPIO_226_GPIO226                0x01C60400U

#define GPIO_227_GPIO227                0x01C60600U

#define GPIO_228_GPIO228                0x01C60800U

#define GPIO_229_GPIO229                0x01C60A00U

#define GPIO_230_GPIO230                0x01C60C00U

#define GPIO_231_GPIO231                0x01C60E00U

#define GPIO_232_GPIO232                0x01C61000U

#define GPIO_233_GPIO233                0x01C61200U

#define GPIO_234_GPIO234                0x01C61400U

#define GPIO_235_GPIO235                0x01C61600U

#define GPIO_236_GPIO236                0x01C61800U

#define GPIO_237_GPIO237                0x01C61A00U

#define GPIO_238_GPIO238                0x01C61C00U

#define GPIO_239_GPIO239                0x01C61E00U

#define GPIO_240_GPIO240                0x01C80000U

#define GPIO_241_GPIO241                0x01C80200U

#define GPIO_242_GPIO242                0x01C80400U

#endif // PIN_MAP_H
